
---

### 배열 (Array)

배열은 가장 기본적인 데이터 구조이다. 배열은 생성시 설정된 셀의 수가 고정되고, 각 셀에는 인덱스 번호가 부여된다. 배열은 활용 시 부여된 인덱스를 통해 해당 셀에 있는 데이터에 접근할 수 있다.

### 배열의 시간복잡도

![![study/자료구조/#^Table1]]
배열 내 연산은 크게 접근, 검색, 추가, 제거 등이 있다.


### 접근

>   
>   배열의 접근은 O(1)의 시간복잡도를 갖는다. 따라서 찾고자 하는 값의 인덱스값을 알고 있다면 굉장히 
>   빠른 검색 속도를 갖는다.
>   

### 검색

>   
>   배열의 검색은 순차검색 이므로 인덱스를 알지 못할 때 원하는 값을 찾기 위해 배열을 하나하나 확인해야 한다.
>   ![](https://i.imgur.com/HI7Xtlh.png)
>   
>   A[3]의 값을 찾기 위해 A[0], A[1]... 을 순서대로 검색하기 때문에 최대 O(n)의 시간 복잡도를 가진다.
>

### 추가, 삭제

>   ![](https://i.imgur.com/H8aQO9I.png)
>
>   추가, 삭제의 시간복잡도는 앞서 말한 접근과 검색의 방법에 따라 시간복잡도가 나뉜다.
>   A[6]에 5라는 값을 넣고, 혹은 빼고 싶을 때 해당 인덱스값을 알고 있다면 접근의 개념으로 O(1)의 
>   시간복잡도를 가지지만 해당 인덱스를 찾아야한다면 검색의 시간복잡도인 O(n)에 해당한다.
>

---

### 단점.

>
>   - 고정된 크기:
>   배열은 생성할 때 크기가 정해지며, 크기를 변경하기 어렵다. 만약 배열의 크기를 초과하려면 새로운 배열을 생성하고 기존 배열의 요소를 복사해야 한다.
>   - 메모리 낭비:
>   배열은 고정된 크기를 가지므로 필요한 크기보다 큰 배열을 생성하면 메모리가 낭비될 수 있다.
>   - 같은 데이터 타입의 요소만 저장이 가능:
>   배열은 동일한 데이터 타입의 요소만 저장할 수 있다. 서로 다른 데이터 타입의 요소를 저장하려면 객체나 다른 자료구조를 사용해야 한다.
>   - 삽입과 삭제의 어려움:
>   배열에서 요소를 삽입하거나 삭제하는 것은 복잡하며 비효율적이다. 배열 중간에 요소를 삽입하거나 삭제하면 모든 뒤따라오는 요소들의 인덱스를 조정해야 한다.
>   

