
---
### WAN 이란?

WAN(광역 네트워크)는 먼 거리에 있는 컴퓨터 그룹을 연결하기 위한 대규모 컴퓨터 네트워크이다. WAN은 대기업 사무실 네트워크를 연결하는데 주로 사용한다. 각 사무실에는 일반적으로 [[LAN(근거리 통신망)]] 이 있으며, 이러한 LAN은 WAN을 통해 연결된다. 이러한 긴 연결은 [[임대 회선]], [[VPN]], IP 터널 등 여러 방법으로 형성될 수 있다.

WAN의 구성 요소는 상당히 광범위 하다. 기술적으론, 넓은 지리적 영역에 걸쳐 분산된 모든 대규모 네트워크가 WAN이다. [[인터넷]] 자체도 WAN으로 간주한다.

### 소프트웨어 정의 WAN(SD-WAN)이란?

소프트웨어 정의 WAN(SD-WAN)은 여러 하드웨어 플랫폼과 연결 옵션을 활용할 수 있는 유연한 아키텍처이다. 제어 소프트웨어는 모든 네트워킹 하드웨어에서 작동한다.

SD-WAN은 소프트웨어로 네트워크를 강의할 수 있는 기술 범주인 소프트웨어 네트워킹(SDN)의 한 형태이다. SD-WAN은 또한 네트워킹 및 네트워크 보안 기능을 단일 클라우드 기반 서비스로 결합하는 [[보안 엑세스 서비스 에지(SASE)]] 솔루션의 핵심 구성 요소이다.

### 서비스형 WAN이란?

서비스형 WAN은 [[클라우드 기반]] WAN 모델이다. 서비스형 WAN은 하드웨어에 의존하고 다중 프로토콜 레이블 스위칭(MPLS)과 같은 연결 프로토콜을 사용하며 확장하기 어려운 레거시 WAN 구성을 대체하도록 설계됨. 서비스형 WAN 구성을 대체하도록 설계됨. WAN은 클라우드를 통해서 제공되므로 고객은 인터넷 연결만 하면 끝이고 하드웨어 장비를 사용하는 대신 소프트웨어를 사용하여 WAN을 구성할 수 있다. 이거 말고도 [[서비스형 네트워크(NaaS)]] 이런거도 있음.